; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 504381 2 3 3 5 2
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	image0 - mode
	thermograph2 - mode
	spectrograph1 - mode
	Star0 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	Star4 - direction
	Planet5 - direction
	Phenomenon6 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 spectrograph1)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument2 image0)
	(supports instrument2 thermograph2)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 spectrograph1)
	(supports instrument3 image0)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 Star4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon6)
)
(:goal (and
	(have_image Planet5 spectrograph1)
	(have_image Phenomenon6 thermograph2)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 2
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 2
3. (turn_to satellite0 planet5 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet5)
   goals met: 0 of 2
4. (turn_to satellite1 groundstation3 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 groundstation3)
   goals met: 0 of 2
5. (calibrate satellite1 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 0 of 2
6. (turn_to satellite0 phenomenon6 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon6)
   goals met: 0 of 2
7. (turn_to satellite1 planet5 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 planet5)
   goals met: 0 of 2
8. (turn_to satellite0 groundstation1 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 2
9. (take_image satellite1 planet5 instrument2 spectrograph1)
   added: (have_image planet5 spectrograph1)
   goals met: 1 of 2
10. (calibrate satellite0 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 1 of 2
11. (turn_to satellite1 phenomenon6 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 phenomenon6)
   goals met: 1 of 2
12. (turn_to satellite0 phenomenon6 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon6)
   goals met: 1 of 2
13. (take_image satellite1 phenomenon6 instrument2 thermograph2)
   added: (have_image phenomenon6 thermograph2)
   goals met: 2 of 2
